Christophe Van Gysel
Remedies against the Vocabulary Gap in Information Retrieval
Search engines rely heavily on term-based approaches that
represent queries and documents as bags of
words.
Text—a
document or a query—is represented by a bag of
its words
that
ignores
grammar
and word order,
but
retains
word
frequency counts.
When presented with a search query,
the
engine then ranks documents according to their
relevance
scores
by
computing,
among other
things,
the matching
degrees between query and document
terms.
While term-
based approaches are intuitive and effective in practice,
they
are based on the hypothesis that
documents that
exactly
contain the query terms
are highly relevant
regardless
of
query semantics.
Inversely,
term-based approaches assume
documents that
do not
contain query terms as irrelevant.
However,
it
is known that
a high matching degree at
the
term level does not necessarily mean high relevance and,
vice
versa,
documents that match null
query terms may still
be
relevant.
Consequently,
there
exists
a
vocabulary
gap
between queries and documents that occurs when both use
different
words
to describe the same concepts.
It
is
the
alleviation of
the effect brought forward by this vocabulary
gap that is the topic of this dissertation. More specifically,
we
propose (1)
methods to formulate an effective query from
complex textual structures and (2) latent vector space models
that circumvent the vocabulary gap in information retrieval.
CHRISTOPHE 
VAN GYSEL
IN INFORMATION RETRIEVAL
REMEDIES AGAINST
THE VOCABULARY GAP 
828385
789461
9
ISBN 9789461828385
arXiv:1711.06004v1 [cs.IR] 16 Nov 2017
Remedies against the Vocabulary Gap
in Information Retrieval
Christophe Van Gysel
This version differs from the official version submitted to the university
through minor changes in Chapters 4 and 8.
Remedies against the Vocabulary Gap
in Information Retrieval
A
CADEMISCH
P
ROEFSCHRIFT
ter verkrijging van de graad van doctor aan de
Universiteit van Amsterdam
op gezag van de Rector Magnificus
prof. dr. ir. K.I.J. Maex
ten overstaan van een door het College voor Promoties ingestelde
commissie, in het openbaar te verdedigen in
de Agnietenkapel
op vrijdag 17 november 2017, te 12:00 uur
door
Christophe Jacky Henri Van Gysel
geboren te Lier, Belgi
¨
e
Promotiecommissie
Promotor:
Prof. dr. M. de Rijke
Universiteit van Amsterdam
Co-promotor:
Dr. E. Kanoulas
Universiteit van Amsterdam
Overige leden:
Prof. dr. B. Goethals
Universiteit Antwerpen
Dr. K. Hofmann
Microsoft Research Cambridge
Dr. C. Monz
Universiteit van Amsterdam
Prof. dr. M. Welling
Universiteit van Amsterdam
Prof. dr. M. Worring
Universiteit van Amsterdam
Faculteit der Natuurwetenschappen, Wiskunde en Informatica
The research was supported by the European Community’s Seventh Framework Pro-
gramme (FP7/2007-2013) under grant agreement nr 312827 (VOX-Pol), the Google
Faculty Research Award scheme and the Bloomberg Research Grant program.
All content represents the opinion of the author,
which is not necessarily shared or
endorsed by his respective employers and/or sponsors.
Computing resources were provided by the Netherlands Organisation for Scientific
Research (NWO) through allocation SH-322-15 of the Cartesius system, the Advanced
School for Computing and Imaging (ASCII) by allocation of the Distributed ASCII Su-
percomputer 4 (DAS-4) system and the Information and Language Processing Systems
group.
Copyright © 2017 Christophe Van Gysel, Amsterdam, The Netherlands
Cover by Samira Abnar and Mostafa Dehghani
Printed by Off Page, Amsterdam
ISBN: 978-94-6182-838-5
Acknowledgements
I never intended to pursue a doctorate degree.
Senior researchers—academics and industry folks alike—kept repeating that a masters
degree and an engineering position at a high-end technology giant would be the better
career path.
After all,
postgraduate studies are often described as one of the few
remaining forms of modern slavery in the Western world.
1
Given that this dissertation
completes my postgraduate degree, I can only conclude that I’m susceptible to reverse
psychology.
At the end of August 2014, I was spending a few months in New York. It was there that
I was told that the postgraduate student experience has just one significant factor: the
student’s advisor.
This was only a few days after I had first met with my prospective
advisor—Maarten. The postgraduate experience boiled down to the following question:
“Is the student’s advisor a lion or a wolf?”
2
Will your advisor fight for you—as a lion—or
misguide you and stab you in the back—as a wolf? After these three years, I can say
with certainty that Maarten resembles something closer to a griffin: a mythical lion with
wings. Consequently, it goes without saying that I express my deepest gratitude towards
Maarten for his guidance and ideas.
I also thank my co-advisor, Evangelos, for his insightful feedback and the inspiring
conversations we shared.
Before Evangelos became my co-advisor,
I was working
closely with Marcel. Marcel, thank you for the guidance during those first few months.
I am honoured to have a graduation committee consisting of very talented researchers
from a wide variety of backgrounds.
Bart, Christof, Katja, Marcel, Max, thank you
for taking the time to read my dissertation and your valuable feedback.
Likewise, I
thank my paranymphs, Hosein and Rolf, for standing by me during the defence of this
dissertation.
I thank the vocabulary gap for being an interesting problem that I could write this
dissertation on.
Science cannot exist without collaborations and I thank my co-authors for all the hard
work.
Alexey, Bart, Bhaskar, Evangelos, Fran
c¸
oise, Grzegorz, Ian, Leonid, Maarten,
Marcel, Matteo, Mostafa, Nicola, Piotr, Roy and Tom, thank you for discussions, the
modelling, the experiments, the writing, the polishing and the publishing.
We all have to start somewhere and I would express my gratitude to the people who
helped me during the early days of my post-graduate studies. Thank you, Daan, Manos,
Tom and Zhaochun.
Science, and consequently life, would be boring without the social aspect of it. Thanks
to my colleagues at ILPS for the insightful discussions, the support and the fun evenings:
Abdo, Adith, Aldo, Aleksandr, Alexey, Ana, Anna, Anne, Arianna, Artem, Bob, Boris,
Chang, Chuan, Cristina, Daan, Damien, Dan, Dat, David, David, Dilek, Eva, Evgeny,
Fei, Hamid, Harrie, Hendrik, Hendrike, Hosein, Ilya, Isaac, Iva, Ivan, Julia, Kaspar,
1
http://www.independent.co.uk/news/education/education-news/
postgraduate-students-are-being-used-as-slave-labour-7791509.html
2
https://www.math.ku.edu/
˜
jmartin/fun/grad.html
Katya, Ke, Lars, Maarten, Marlies, Marzieh, Masrour, Mostafa, Nikos, Praveen, Richard,
Ridho, Rolf, Shangsong, Svitlana, Tobias, Tom, Xiaojuan, Xinyi, Yaser, Zhaochun and
Ziming.
Petra, thank you for everything. You are invaluable within ILPS.
During the course of my masters studies at the University of Antwerp and my doctoral
studies at the University of Amsterdam I gained priceless experience as part of my 7
internships: (1 & 2) Gus, Sam and Sam, with whom I worked at the ads ranking quality
team of Google, thank you. It was during my time there that I first started wondering
about pursuing a doctoral degree. (3) Alec, Chad and Christopher, who supervised me
at the infrastructure security team at Facebook. Thanks for the hacking. (4) Thanks to
Leonid, Ian and Fran
c¸
oise who provided me with my first industrial research experience
at the speech team of Google. (5) Yi, Xiaochuan and Ilya, who motivated me to push
the limits of speech recognition, at the language modelling team of Apple. (6) Bhaskar,
Matteo and Nicola, whom I worked with at the query formulation team of Microsoft
Bing. Thanks for including me into the team and showing me that research and product
development go hand in hand. (7) Finally, thanks to Sushobhan, Xinran and Jie, at the
search team of Snap Inc., who had a vocabulary gap that needed to be bridged.
Many friends supported my throughout my doctoral studies. I thank my friends that I
met during my journey at the University of Antwerp and the Association of Mathematics,
Informatics and Physics.
It has been an amazing few years and I know that I should
visit more often. Beyond Antwerp, I thank my friends that I met while travelling and
participating in foreign exchanges.
I thank my parents, Catherine and Marc, for their eternal support. Without their guidance,
I would not be where I am today. My brother, Cedric, thank you for your support and
the discussions. My grandparents, Harry, Henri, Jacky, Lisette, thank you for always
looking after me. My aunt and uncle, Ingrid and Patrick, thank you for conversations
and gatherings. My cousins, Alexandar, Amelie, Laurens, Sarah, thanks for all the good
times.
Last, but not least, I thank my girlfriend, Katya, for all her love, support and understand-
ing.
Contents
1
Introduction
1
1.1
Research outline and questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
2
1.1.1
Query formulation
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
2
1.1.2
Latent vector spaces
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
3
1.2
Main contributions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
4
1.2.1
Algorithmic contributions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
4
1.2.2
Theoretical contributions .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
4
1.2.3
Empirical contributions .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
5
1.2.4
Open-source software contributions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
5
1.3
Thesis overview .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
6
1.4
Origins
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
6
2
Background
9
2.1
Query formulation
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
9
2.1.1
Session search
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
9
2.1.2
Proactive information retrieval
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
10
2.1.3
Predictive models for email
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
10
2.1.4
Query formulation and reformulation
.
.
.
.
.
.
.
.
.
.
.
.
.
11
2.2
Latent semantic models .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
12
2.2.1
Latent semantic models for information retrieval
.
.
.
.
.
.
.
12
2.2.2
Entity retrieval
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
13
2.2.3
Neural language modelling .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
15
2.2.4
Neural information retrieval
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
16
I
Query Formulation
17
3
Lexical Query Modelling in Session Search
19
3.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
19
3.2
Lexical matching for sessions .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
19
3.3
Experiments .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
22
3.3.1
Benchmarks .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
22
3.3.2
Evaluation measures
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
22
3.3.3
Systems under comparison .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
22
3.3.4
Ideal lexical term weighting
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
23
3.4
Results & discussion
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
23
3.5
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
27
4
Reply With: Proactive Recommendation of Email Attachments
29
4.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
29
4.2
Related work
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
31
4.3
Proactive attachable item recommendation .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
32
4.3.1
Attachment retrieval
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
33
4.3.2
Evaluating query formulations
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
34
v
CONTENTS
4.4
Query formulation model
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
34
4.4.1
Model training
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
35
4.4.2
A convolutional neural network for ranking query terms
.
.
.
37
4.5
Experimental set-up .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
40
4.5.1
Research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
40
4.5.2
Experimental design
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
41
4.5.3
Data collections and pre-processing
.
.
.
.
.
.
.
.
.
.
.
.
.
.
41
4.5.4
Methods under comparison .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
42
4.5.5
Evaluation measures and significance
.
.
.
.
.
.
.
.
.
.
.
.
.
43
4.6
Results & discussion
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
43
4.6.1
Overview of experimental results
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
43
4.6.2
Analysis of differences .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
46
4.6.3
Feature importance .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
47
4.7
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
48
II
Latent Vector Spaces
49
5
Unsupervised, Efficient and Semantic Expertise Retrieval
51
5.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
51
5.2
Related work
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
52
5.3
A log-linear model for expert search .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
53
5.3.1
The model
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
53
5.3.2
Parameter estimation .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
54
5.4
Experimental setup
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
55
5.4.1
Research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
55
5.4.2
Benchmarks .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
56
5.4.3
Baselines
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
56
5.4.4
Implementation details
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
58
5.5
Results & discussion
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
58
5.5.1
Overview of experimental results
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
58
5.5.2
Error analysis .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
63
5.5.3
Scalability and efficiency .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
65
5.5.4
Incremental indexing .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
69
5.6
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
69
5.7
Appendix
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
70
6
Structural Regularities in Text-based Entity Vector Spaces
73
6.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
73
6.2
Related work
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
74
6.3
Text-based entity vector spaces .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
75
6.4
Experimental set-up .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
76
6.4.1
Research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
76
6.4.2
Expert finding collections
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
77
6.4.3
Implementations and parameters .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
77
6.5
Regularities in entity vector spaces .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
78
vi
CONTENTS
6.5.1
Answers to research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
78
6.5.2
Analysis of the expert prior in the log-linear model
.
.
.
.
.
.
82
6.6
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
84
7
Learning Latent Vector Spaces for Product Search
87
7.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
87
7.2
Related work
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
89
7.3
Latent vector spaces for entity retrieval .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
90
7.3.1
Background .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
90
7.3.2
Latent semantic entities .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
91
7.3.3
Parameter estimation .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
92
7.4
Experimental setup
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
93
7.4.1
Research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
93
7.4.2
Experimental design
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
94
7.4.3
Product search benchmarks .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
97
7.4.4
Evaluation measures and significance
.
.
.
.
.
.
.
.
.
.
.
.
.
97
7.4.5
Methods used in comparisons
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
97
7.5
Results & discussion
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
98
7.5.1
Overview of experimental results
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
98
7.5.2
A feature for machine-learned ranking .
.
.
.
.
.
.
.
.
.
.
.
.
100
7.6
Analysis of representations
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
102
7.7
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
105
8
Neural Vector Spaces for Unsupervised Information Retrieval
107
8.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
107
8.2
Related work
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
108
8.3
Learning semantic spaces .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
109
8.3.1
The Neural Vector Space Model
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
109
8.3.2
The objective and its optimization .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
110
8.3.3
Implementation .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
113
8.4
Experimental setup
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
114
8.4.1
Research questions
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
114
8.4.2
Benchmark datasets & experiments
.
.
.
.
.
.
.
.
.
.
.
.
.
.
115
8.4.3
Retrieval models considered for comparison .
.
.
.
.
.
.
.
.
.
116
8.4.4
Evaluation measures and statistical significance .
.
.
.
.
.
.
.
119
8.5
Results .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
120
8.5.1
Performance of NVSM .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
120
8.5.2
Query-level analysis
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
120
8.5.3
Semantic vs. lexical matching
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
120
8.5.4
NVSM and Luhn significance
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
125
8.6
Discussion and analysis .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
125
8.6.1
An investigation of judgement bias .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
125
8.6.2
Unsupervised deployment
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
126
8.7
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
128
vii
CONTENTS
9
Conclusions
135
9.1
Main findings
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
135
9.2
Future work .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
137
A Pyndri: A Python Interface to the Indri Search Engine
143
A.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
143
A.2
Introducing Pyndri
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
143
A.2.1
Low-level access to document repository
.
.
.
.
.
.
.
.
.
.
.
144
A.2.2
Querying Indri from Python
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
145
A.3
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
145
B Semantic Entity Retrieval Toolkit
147
B.1
Introduction .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
147
B.2
The toolkit .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
147
B.2.1
Collection parsing and preparation .
.
.
.
.
.
.
.
.
.
.
.
.
.
.
148
B.2.2
Representation learning
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
148
B.2.3
Entity ranking & other uses of the representations .
.
.
.
.
.
.
149
B.3
Summary
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
.
150
Bibliography
151
Samenvatting
162
Summary
164
viii
1
Introduction
Search engines heavily rely on term-based approaches according to which queries
and documents are represented as bags of words.
Text—a document or a query—is
represented by a bag of its words that ignores grammar and word order, but retains
word frequency counts.
When presented with a search query, the engine then ranks
documents according to their relevance scores by computing, among other things, the
matching degrees between query and document terms. While term-based approaches
are intuitive and effective in practice, they are based on the hypothesis that documents
that exactly contain the query terms are highly relevant regardless of query semantics.
Inversely, term-based approaches assume documents that do not contain query terms
to be irrelevant.
Li and Xu
[146]
note that a high matching degree at the term level
does not necessarily mean high relevance and, vice versa, documents that match null
query terms may still be relevant. Consequently, there exists a vocabulary gap between
queries and documents that occurs when both use different words to describe the same
concepts.
In addition to the crude heuristic that mandates document relevance to be a function
of query/document term overlap, the ubiquity of term-based approaches can be explained
by efficiency constraints imposed on retrieval engines.
The typical concise nature of
queries, together with term-based matching, is used to filter out documents without
query terms using a specialized data structure called the inverted index [
66
, p.
129:
Section 5.3].
An inverted index operates in a similar way as a subject
index in a
reference book. For example, in an encyclopedia, the subject index contains references
to pages that discuss a particular subject.
Consequently,
the reader is redeemed of
the cumbersome task of determining the relevance of every page individually w.r.t.
her information need.
Search engines employ a filter-and-refine strategy where an
initial method, typically the lookup in an inverted index, is used to generate a pool of
candidate documents [
151
, p. 135: Section 10.3]. The pool of candidate documents is
subsequently re-ranked using more expensive methods [166].
There are, however, two major drawbacks of the inverted index that are relevant to
this dissertation: (1) Following up on our earlier discussion, term-based retrieval may
incorrectly classify relevant documents that do not contain query terms as irrelevant.
This negatively affects the recall of the retrieval results. Given that term-based retrieval
is used for an initial filtering of documents, semantic matching re-rankers applied dur-
ing the refining step of the retrieval pipeline are powerless when it comes to relevant
1
1. Introduction
documents whose terms overlap little with the textual query issued by the user. (2) To
alleviate the filtering of false negatives, search engines often automatically reformulate
queries by adding terms (i.e., expansion) [
66
, p. 199: Section 6.2.3]. However, query
expansion is a double-edged sword as Grossman et al.
[98]
show that the number of
CPU operations and the disk I/O grow superlinearly—while the number of novel dis-
covered relevant documents diminishes rapidly—with the query size. In fact, incautious
and overzealous query expansion causes query drift [
180
] and generates a candidate
document set that is unrelated to the original query [165, p. 187: Section 9.1.6].
This dissertation directly targets these two pitfalls of the inverted index and ap-
proaches the shortcomings of the inverted index from two opposite angles.
(1) In
Part I, we formulate queries from complex and heterogeneous textual structures (search
sessions and email threads) so as to fulfill the user’s information need. Search sessions
consist of a sequence of user interactions (i.e., query reformulations, clicks), search
engine responses (i.e., ranked documents in a result page, also referred to as SERP) and
are indicative of a complex information need.
The task is then to formulate a textual
query to satisfy the overall information need that characterizes the session. In the case
of email threads, the explicit information need is less straightforward. We focus on a
particular case where an incoming email message is a request for content. The task is
then to formulate a query that correctly retrieves the appropriate item from a document
repository. Overall, the common goal of the research performed in Part I is to formulate
queries that are (a) shorter and (b) exhibit more effective retrieval than taking the full
textual structure as a query (i.e., queries/SERPs and full email messages for the session
and email domains, respectively).
(2) Query expansion is a slippery slope as adding
more terms increases latency and can cause query drift.
However, nearest neighbour
algorithms can be more efficient than classical term-based retrieval [
43
] and, conse-
quently, may be used as an alternative [
147
] or in addition [
201
] to the inverted index.
Therefore, Part II is dedicated to the modelling of latent vector spaces for information
retrieval (IR). In particular, we focus on retrieval domains where semantic matching is
known to be important: entities [20, 69] and news articles [107].
1.1
Research outline and questions
The broad theme of this dissertation involves fulfilling information needs that
are
(1) embedded within complex textual structures,
such as sessions or email threads
through
query formulation
, and (2) expressed as textual queries that require
semantic
matching
(e.g., informational queries [
44
]). Below, we introduce the high-level research
questions answered in the respective chapters. In each chapter, we pose multiple sub-
questions whose answers are combined to answer the higher-level questions below.
1.1.1
Query formulation
Information needs are often posed in a form that is more complex than a single short
user-formulated textual query.
What if we know the user is trying to accomplish a
complex task by issuing multiple short queries?
At first,
the user issues an initial
query.
Subsequently, at each step the user observes feedback from the search engine
2
1.1. Research outline and questions
and reformulates her request.
How can we use the previously-issued queries and the
documents observed by the user to improve retrieval effectiveness? In the case of email
threads, many emails contain implicit or explicit requests for content. Can we formulate
a query from email threads that retrieves the relevant content to be attached? This bring
us to our first research question:
RQ1
How to formulate a query from complex textual
structures—such as search
sessions or email threads—in order to better answer an information need?
We perform an analysis on session search logs from TREC and provide empirical
insight in the potential of lexical language models (Chapter 3).
Building upon this
insight, we propose a Convolutional Neural Network (
CNN
) that formulates a query
from email requests for the task of proactive attachment recommendation (Chapter 4).
1.1.2
Latent vector spaces
Entities (e.g., people, products) are often characterized by large bodies of text [
23
,
170
].
Bag of words approaches may degrade for long documents due to their verbosity and
scope [
67
]. In addition, entity domains require more semantic matching than domains
where navigational queries are prevalent (e.g., Web search) as entity-oriented queries
often describe the entity rather than searching for a known-item. For example, in expert
finding,
users describe the expertise of the expert they are searching for instead of
the name of the expert herself [
245
]. When searching for products on an e-commerce
website, users often formulate queries by listing the characteristics of the product they
are interested in [217].
RQ2
Can we learn a latent vector space of retrievable entities that performs well for
retrieval?
We introduce the log-linear model for expert finding and show its effectiveness
on three expert finding benchmarks (Chapter 5).
In expert finding, the user issues a
topical query and is presented with a ranking of people. We perform an analysis of the
semantic matching performed by the model and give insight in the regularities contained
within latent expert representations (Chapter 6). For example, we show that experts who
operate in similar domains have similar representations.
In
RQ2
we consider a particular entity domain (i.e., expert finding) that consists of
a small number of entities that each have a large body of associated text. In addition, the
queries in the expert domain require semantic matching, as users describe the domain
of the expert and known-item queries are inherently not part of the expert finding task.
However, the training procedure proposed in response to
RQ2
is linear in the number of
entities. This is impractical as it severely limits the training speed. In the next research
question, we address this impracticality and investigate sampling methods to scale up
training to large entity spaces.
RQ3
Can we scale up latent vector spaces to larger entity domains that have less textual
content per entity compared to the expert finding setting?
3
1. Introduction
To answer
RQ3
we scale up the model training to large entity spaces by sampling
negative examples (Chapter 7). However, its retrieval effectiveness diminishes as the
number of retrievable entities increases. Furthermore, how do our latent vector spaces
perform on non-entity domains? We address these concerns in RQ4.
RQ4 Can we further increase the retrieval effectiveness and scale latent vector spaces
up to hundreds of thousands of documents?
Our final research question,
RQ4
, is answered in Chapter 8 by the introduction of
the Neural Vector Space Model (
NVSM
). We improve the loss function of our latent
vector spaces by incorporating
IR
-specific regularities and evaluate
NVSM
on article
retrieval benchmarks from TREC.
1.2
Main contributions
The main contributions of this dissertation are listed in this section. Our contributions
come in the form of algorithmic,
theoretical,
empirical
and open-source software
contributions.
For each contribution,
we list the chapter where the contribution is
made or, in the case of software packages, where the package was used to generate
experimental results.
1.2.1
Algorithmic contributions
1.
A frequency-based approach to represent a user’s information need in session
search. [Ch. 3]
2.
A Convolutional Neural Network (
CNN
) that learns to formulate queries that
retrieve attachments in accordance to incoming request messages. [Ch. 4]
3.
Three latent vector space models: the log-linear model for expert finding, Latent
Semantic Entities (
LSE
) and the Neural Vector Space Model (
NVSM
). [
Ch. 5, 7
and 8]
1.2.2
Theoretical contributions
4.
A proactive email recommendation task, including a methodology for creating
pseudo collections for model training and testing. [Ch. 4]
5.
A formal framework for ranking attachments given a ranking over email messages
that contain them. [Ch. 4]
6.
Analyses of the time/space complexity of the log-linear model for expert finding
and the NVSM. [Ch. 5 and 8]
7.
A framework for analysing the quality of different entity representations, inde-
pendent of the textual matching component. [Ch. 7]
4
1.2. Main contributions
1.2.3
Empirical contributions
8.
(a) Analysis of the TREC Session Track that shows the prominence of short
search sessions within the benchmarks.
(b) Investigation of the effectiveness
of specialized session search methods compared to our naive frequency-based
approach. (c) Investigation of the viability of lexical query matching in session
search. [Ch. 3]
9.
Comparison of different query term formulation methods, their effectiveness and
an analysis of the formulated queries and errors. [Ch. 4]
10.
(a) Comparison of the log-linear model for expert finding with state-of-the-art
retrieval methods, including traditional vector space models and language models.
(b) Insight in how the uncertainty of the predictions of the log-linear model can be
used to determine the effectiveness of the model. (c) Comparative error analysis
between the semantic log-linear model and traditional generative language models
that perform exact matching.
(d) Insight in the relative strengths of semantic
matching and exact matching for the expert retrieval task through an ensemble of
the log-linear model and lexical language models. [Ch. 5]
11.
Insight in the domain regularities (i.e., clusterings, similarity, importance) con-
tained within latent entity representations (with an application to expert finding).
[Ch. 6]
12.
(a) A parameter sensitivity analysis of
LSE
models, with a focus on represen-
tation dimensionality and the amount of word context used to train the model.
(b) Comparison of
LSE
models with state-of-the-art latent vector spaces in terms
of retrieval effectiveness and according to the quality of the entity representations.
(c) Insight in how
LSE
can benefit the retrieval performance in entity-oriented
search engines that combine query-independent, lexical and semantic signals in a
learning to rank model. [Ch. 7]
13.
(a) Comparison of Neural Vector Space Model (
NVSM
) with lexical language
models and state-of-the-art latent vector space models on article retrieval collec-
tions. (b) Analysis of the internals of
NVSM
and how it encodes word importance
in the word representations. (c) Insight in the judgement bias inherent in TREC
test collections. (d) Advice on how to configure the hyperparameters of
NVSM
.
[Ch. 8]
1.2.4
Open-source software contributions
14.
sesh (
https://github.com/cvangysel/sesh
) — a testbed for evaluating session
search. [Ch. 3]
15.
SERT (
https://github.com/cvangysel/SERT
) — the Semantic Entity Retrieval
Toolkit that contains implementations of the log-linear model for expert finding
and Latent Semantic Entities (LSE). [Ch. 5, 6, 7 and App. B]
5
1. Introduction
16.
cuNVSM (
https://github.com/cvangysel/cuNVSM
) — a highly-optimized CUDA
implementation of
LSE
and
NVSM
that results in fast training and efficient mem-
ory usage. [Ch. 8]
17.
pyndri (
https://github.com/cvangysel/pyndri
) — a Python interface to the
Indri search engine. [Ch.
3, 4, 8 and App. A]
Only the software used for the experiments of Chapter 4 has not been released open-
source as it is intellectual property of Microsoft Corporation.
1.3
Thesis overview
In this section we give an overview of the dissertation and provide recommendations
for reading directions.
The chapter you are currently enjoying (Chapter 1) gives an introduction to the
subject of this dissertation. In addition, the chapter provides an overview of the research
questions and contributions. Chapter 2 discusses related work for the Chapters 3 to 8
that follow.
Part I of this dissertation contains research chapters related to query formulation
from complex textual structures. In particular, Chapter 3 investigates the potential of
lexical query formulation methods in session search. Chapter 4 introduces the task of
proactive email attachment recommendation.
In addition, it proposes a method that
formulates a lexical query from an email thread
Part II of this dissertation introduces novel latent vector spaces for Information
Retrieval. Chapter 5 targets a particular instance of the entity ranking task: expert finding.
Chapter 6 performs additional analysis on the learned latent expert representations. The
expert finding model is then adapted to larger entity domains (i.e., product search) in
Chapter 7.
Chapter 8 introduces
NVSM
, an extension to
LSE
that brings qualitative
improvements. We evaluate
NVSM
on article retrieval and perform an in-depth analysis
of its matching signal. In addition, we investigate the pool bias in off-line test collections
and give practical advice on how to configure the hyperparameters of NVSM.
We conclude this dissertation in Chapter 9 and give directions for future work.
Appendices A and B provide a description of some of the software that was developed
as part of this dissertation.
Readers familiar with retrieval models and latent vector spaces may skip the appro-
priate parts of Chapter 2. Part I and Part II can be read independently of each other. If
time is of the essence, only read Chapters 4, 8 and 9.
1.4
Origins
We list for each chapter the publications on which it is based. The dissertation is based
on, in total, 9 publications [253, 256–263].
Chapter 3
is based on the conference paper Lexical Query Modeling in Session Search
published at ICTIR’16 by Van Gysel, Kanoulas, and de Rijke [258].
6
1.4. Origins
The naive baseline method was designed by Van Gysel, experiments and analyses
were performed by Van Gysel. All authors contributed to the text, Van Gysel did
most of the writing.
Chapter 4
is based on the conference paper Reply With: Proactive Recommendation
of
Email
Attachments published at
CIKM’17 by Van Gysel,
Mitra,
Venanzi,
Rosemarin, Kukla, Grudzien, and Cancedda [263].
The research was performed during a research internship at Microsoft Bing in
London.
The task was proposed by Mitra, Venanzi and Cancedda.
The model
was designed by Van Gysel and was inspired by ideas of Mitra. Some parts of the
model were inspired through suggestions by Venanzi, Cancedda and Rosemarin.
Kukla and Rosemarin helped by providing data. Grudzien performed additional
analysis.
Van Gysel did most of the writing, with the help of Mitra.
Venanzi,
Cancedda and Rosemarin also contributed to the text.
Chapter 5
is based on the conference paper Unsupervised,
Efficient and Semantic
Expertise Retrieval published at WWW’16 by Van Gysel, de Rijke, and Worring
[253, 257].
The model was designed by Van Gysel, experiments and analyses were performed
by Van Gysel.
All authors contributed to the text, Van Gysel did most of the
writing.
Chapter 6
is based on the conference paper Structural Regularities in Expert Vector
Spaces published at ICTIR’17 by Van Gysel, de Rijke, and Kanoulas [259].
Experiments and analyses were performed by Van Gysel. All authors contributed
to the text, Van Gysel did most of the writing.
Chapter 7
is based on the conference paper Learning Latent Vector Spaces for Product
Search published at CIKM’16 by Van Gysel, de Rijke, and Kanoulas [256].
The model was designed by Van Gysel, experiments and analyses were performed
by Van Gysel.
All authors contributed to the text, Van Gysel did most of the
writing.
Chapter 8
is based on the journal paper Neural Vector Spaces for Unsupervised Infor-
mation Retrieval under review at TOIS by Van Gysel, de Rijke, and Kanoulas
[260].
The model was designed by Van Gysel, experiments and analyses were performed
by Van Gysel.
All authors contributed to the text, Van Gysel did most of the
writing.
Appendix A
is based on the conference paper Pyndri: a Python Interface to the Indri
Search Engine published at ECIR’17 by Van Gysel, Kanoulas, and de Rijke [
262
].
The software was implemented by Van Gysel. The software upon which Pyndri
builds, Indri [
238
], was contributed by the Lemur project. All authors contributed
to the text, Van Gysel did most of the writing.
7
1. Introduction
Appendix B
is based on the workshop paper Semantic Entity Retrieval Toolkit pub-
lished at NeuIR’17 by Van Gysel, de Rijke, and Kanoulas [261].
The software was implemented by Van Gysel. All authors contributed to the text,
Van Gysel did most of the writing.
Work performed as part of this dissertation also contributed to and benefited from
insights gained through research that led to the following publications:
•
C. Van Gysel.
Listening to the flock - towards opinion mining through data-
parallel, semi-supervised learning on social graphs.
Master’s thesis, University of
Antwerp, 2014
•
C. Van Gysel, B. Goethals, and M. de Rijke. Determining the presence of political
parties in social circles.
In ICWSM, volume 2015, pages 690–693, 2015
•
C. Van Gysel, L. Velikovich, I. McGraw, and F. Beaufays.
Garbage modeling for
on-device speech recognition.
In Interspeech, volume 2015, pages 2127–2131,
2015
•
C. Van Gysel, I. Oparin, X. Niu, and Y. Su.
Rank-reduced token representation
for automatic speech recognition, 2017.
US Patent Application 15/459,481
•
T. Kenter, A. Borisov, C. Van Gysel, M. Dehghani, M. de Rijke, and B. Mitra.
Neural networks for information retrieval.
In SIGIR 2017, pages 1403–1406.
ACM, 2017
8
2
Background
In this chapter, we discuss the background for the research presented in this dissertation.
The related work concerning Part I and Part II is covered in Section 2.1 and Section 2.2,
respectively. We assume that the reader is familiar with the basic principles underlying
modern information retrieval, as can be found in, e.g., [66, 165].
2.1
Query formulation
We first cover work related to application domains:
session search (Section 2.1.1),
proactive information retrieval (Section 2.1.2) and email (Section 2.1.3).
2.1.1
Session search
Many complex information seeking tasks,
such as planning a trip or buying a car,
cannot sufficiently be expressed in a single query [
111
]. These multi-faceted tasks are
exploratory,
comprehensive,
survey-like or comparative in nature [
207
] and require
multiple search iterations to be adequately answered [
136
]. Donato et al.
[75]
note that
10% of the user sessions of a web search engine (more than 25% of query volume)
consists of such complex information needs.
The TREC Session Track [
246
] created an environment for researchers “to test
whether systems can improve their performance for a given query by using previous
queries and user interactions with the retrieval system.”
The track’s existence led
to an increasing number of methods aimed at improving session search.
Yang et al.
[281]
introduce the Query Change Model (
QCM
), which uses lexical editing changes
between consecutive queries in addition to query terms occurring in previously retrieved
documents, to improve session search.
They heuristically construct a lexicon-based
query model for every query in a session.
Query models are then linearly combined
for every document, based on query recency [
281
] or document satisfaction [
51
,
155
],
into a session-wide lexical query model. However, there has been a clear trend towards
the use of supervised learning [
51
,
157
,
281
] and external data sources [
99
,
156
]. Guan
et al.
[99]
perform lexical query expansion by adding higher-order n-grams to queries by
mining document snippets. In addition, they expand query representations by including
anchor texts to previously top-ranked documents in the session.
Carterette et al.
[51]
expand document representations by including incoming anchor texts. Luo et al.
[157]
9
2. Background
introduce a linear point-wise learning-to-rank model that predicts relevance given a
document and query change features. They incorporate document-independent session
features in their ranker. The use of machine-learned ranking and the expansion of query
and document representations is meant to address a specific instance of a wider problem
in information retrieval, namely the query document mismatch [
146
].
In Chapter 3
of this dissertation, we analyse the session query logs made available by TREC and
compare the performance of different lexical query modelling approaches for session
search.
2.1.2
Proactive information retrieval
Zero-query search—or proactive IR—scenarios have received increasing attention
recently [
7
].
However,
similar approaches have also been studied in the past under
other names, such as just-in-time [
210
–
213
], query-free [
110
] or anticipatory [
46
,
149
]
IR. According to Hart and Graham
[110]
, the goal of the proactive retrieval system
is to surface information that helps the user in a broader task.
While some of these
works focus on displaying contextually relevant information next to Web pages [
46
,
62
,
163
,
210
,
212
] or multimedia [
195
], others use audio cues [
189
,
225
] or signals
from other sensors [
211
,
220
] to trigger the retrieval.
In more recent years, proactive
IR systems have re-emerged in the form of intelligent assistant applications on mobile
devices, such as Siri, Google Now and Cortana.
The retrieval in these systems may
involve modelling repetitive usage patterns to proactively show concise information
cards [
233
,
235
] or surface them in response to change in user context such as location
[
31
].
Hart and Graham
[110]
, Budzik and Hammond
[46]
and Liebling et al.
[149]
propose to proactively formulate a query based on the user’s predicted information need.
In contrast to previous work on proactive contextual recommendation, we formulate
a query to retrieve attachable items to assist users with composing emails instead of
supplying information to support content or triggering information cards in mobile assis-
tants. We propose a novel proactive retrieval task for email attachment recommendation
in Chapter 4 of this dissertation.
2.1.3
Predictive models for email
Email overload is the inability to effectively manage communication due to the large
quantity of incoming messages [
275
]. Grevet et al.
[97]
find that work email tends to
be overloaded due to outstanding tasks or reference emails saved for future use.
Ai
et al.
[5]
find that 85% of email searches are targeted at retrieving known items (e.g.,
reference emails, attachments) in mailboxes. Horvitz
[117]
argues that a combination
of two approaches—(1) providing the user with powerful tools, and (2) predicting the
user’s next activity and taking automated actions on her behalf —is effective in many
scenarios. Modern email clients may better alleviate email overload and improve user
experience by incorporating predictive models that try to anticipate the user’s need and
act on their behalf.
Missing attachments in email generates a wave of responses notifying the sender of
her error. Dredze et al.
[76]
present a method that notifies the user when a file should
be attached before the email is sent. Castro et al.
[53]
proposed a learning framework
10
2.1. Query formulation
to predict the action that will be performed on an email by the user, with the aim of
prioritizing actionable emails. Carvalho and Cohen
[52]
classify emails according to
their speech acts. Graus et al.
[94]
, Qadir et al.
[206]
recommend recipients to send an
email message to. Kannan et al.
[127]
propose an end-to-end method for automatically
generating email responses that can be sent by the user with a single click. In Chapter 4
of this dissertation, we introduce a neural network architecture that learns to formulate
a query to predict items to attach to an email reply.
2.1.4
Query formulation and reformulation
The task we study in Chapter 4, i.e., the task of contextual recommendation of attachable
items by means of query formulation, has not received much attention. However, there
is work on query extraction from verbose queries and query construction for related
patent search.
Similar to our work in Part I, the methods below consider the search
engine as a black box.
2.1.4.1
Prior art search
Establishing novelty is an important part of the patenting process. Patent practitioners
(e.g., lawyers, patent office examiners) employ a search strategy where they construct a
query based on a new patent application in order to find prior art. However, patents are
different from typical documents due to their length and lack of mid-frequency terms
[158].
Automated query generation methods have been designed to help practitioners
search for prior art. Xue and Croft
[279]
use TF-IDF to generate a ranking of candidate
query terms, considering different patent fields, to rank similar patents. In later work
[
278
],
they incorporate a feature combination approach to further improve prior art
retrieval performance. Alternative term ranking features, such as relative entropy [
164
],
term frequency and log TF-IDF [
54
], have also been explored. Kim et al.
[132]
suggest
boolean queries by extracting terms from a pseudo-relevant document set. Golestan Far
et al.
[93]
find that an interactive relevance feedback approach outperforms state-of-the-
art automated methods in prior art search.
2.1.4.2
Improving verbose queries
Bendersky and Croft
[27]
point out that search engines do not perform well with verbose
queries [
14
]. Kumaran and Carvalho
[140]
propose a sub-query extraction method that
obtains ground truth by considering every sub-query of a verbose query and cast it as
a learning to rank problem.
Xue et al.
[280]
use a Conditional Random Field (CRF)
to predict whether a term should be included. However, inference using their method
becomes intractable in the case of long queries. Lee et al.
[143]
learn to rank query terms
instead of sub-queries with a focus on term dependency. Huston and Croft
[119]
find
that removing the stop structure in collaborative question answering queries increases
retrieval performance.
Maxwell and Croft
[167]
propose a method that selects query
terms based on a pseudo-relevance feedback document set.
Meij et al.
[173]
identify
semantic concepts within queries to suggest query alternatives. Related to the task of
11
2. Background
improving verbose queries is the identification of important terms [
287
]. He and Ounis
[113]
note that the use of relevance scores for query performance prediction is expensive
to compute and focus on a set of pre-retrieval features that are strong predictors of the
query’s ability to retrieve relevant documents. Arguello et al.
[10]
apply query subset
selection on spoken queries. Nogueira and Cho
[192]
apply reinforcement learning to
query reformulation. See [
104
] for an overview on information retrieval with verbose
queries.
In Chapter 3,
we investigate how terms appearing in web search engines user
sessions (e.g., query terms, terms in result page snippets) can be used to reformulate
user queries in order to improve retrieval effectiveness. Chapter 4 introduces a neural
network that formulates a query from email requests for the task of proactive attachment
recommendation.
2.2
Latent semantic models
We first cover related work on Latent Semantic Models (
LSM
)—the subject of Part II—
in Section 2.2.1,
followed by the entity retrieval
task—the application domain of
Chapters 5 to 7—in Section 2.2.2.
Finally,
we review work from neural language
modelling—which inspired the latent vector spaces introduced in this dissertation—in
Section 2.2.3, and neural information retrieval.
2.2.1
Latent semantic models for information retrieval
The mismatch between queries and documents is a critical challenge in search [
146
].
Latent Semantic Models (LSMs) enable retrieval based on conceptual content, instead
of exact term matches.
Especially relevant to this dissertation is the class of unsu-
pervised latent semantic models.
